app/controllers/albums_controller.rb

  def show
    @album = @club.albums.find(params[:id], :include => :tags)
---
SELECT * FROM "albums" WHERE ("albums"."id" = 1)

  def create
    @album = @club.albums.new(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("name", "updated_at", "tags", "club_id", "desc", "user_id", "created_at", "locked") VALUES('TestAlbum', '2009-07-04 02:09:08', 'test', 1, 'A Test Album', '1', '2009-07-04 02:09:08', NULL)