app/controllers/clubs_controller.rb

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
---
  def show
    @club = Club.find(params[:id], :include => :tags)

INSERT INTO "clubs" ("name", "updated_at", "description", "created_at") VALUES('Web-Dev', '2009-07-03 15:50:28', 'Revamping Skule.ca', '2009-07-03 15:50:28')
---
  def create
    @new_club = Club.new(params[:club])

    respond_to do |format|
      if @new_club.save