app/controllers/downloads_controller.rb

  def load_download_folder
    @download_folder = DownloadFolder.find(params[:file_id])
---
SELECT * FROM "download_folders" WHERE ("download_folders"."id" = 2)

  def index
    @downloads = Download.all
---
SELECT * FROM "downloads"

  def show
    @download = Download.find(params[:id])
---
SELECT * FROM "downloads" WHERE ("downloads"."id" = 1)

  def edit
    @download = Download.find(params[:id])
---
SELECT * FROM "downloads" WHERE ("downloads"."id" = 4)

  def create
    @download = Download.new(params[:download])
    @download.url = Download.save(params[:download][:url])
---
INSERT INTO "downloads" ("name", "updated_at", "tags", "url", "desc", "download_folder_id", "created_at") VALUES('cat_enjoy_in_music.gif', '2009-07-04 03:38:36', 'check', 'cat_enjoy_in_music.gif', 'check', 4, '2009-07-04 03:38:36')

  def destroy
    @download = Download.find(params[:id])
    @download_folder = @download.download_folder
    @download.destroy
---
SELECT * FROM "downloads" WHERE ("downloads"."id" = 1)
DELETE FROM "downloads" WHERE "id" = 1