app/controllers/download_folders_controller.rb

SELECT * FROM "clubs" WHERE ("clubs"."id" = 1)
---
  def load_club
    @club = Club.find(params[:club_id])

SELECT * FROM "download_folders" WHERE ("download_folders"."id" = 1)
SELECT * FROM "downloads" WHERE ("downloads".download_folder_id = 2)
---
  def show
    @download_folder = @club.download_folders.find(params[:id])

SELECT * FROM "download_folders" WHERE ("download_folders"."id" = 6)
---
  def edit
    @download_folder = @club.download_folders.find(params[:id])

INSERT INTO "download_folders" ("name", "updated_at", "icon", "club_id", "created_at") VALUES('Source Code!', '2009-07-03 15:51:17', '', 1, '2009-07-03 15:51:17')
---
  def create
    @download_folder = @club.download_folders.new(params[:download_folder])

    respond_to do |format|
      if @download_folder.save

SELECT "download_folders".id FROM "download_folders" WHERE ("download_folders"."club_id" = 2 AND "download_folders".name = 'Check' AND "download_folders".id <> 16) LIMIT 1
UPDATE "download_folders" SET "icon" = 'asd01', "updated_at" = '2009-07-04 03:26:40' WHERE "id" = 6
---
  def update
    @download_folder = @club.download_folders.find(params[:id])

    respond_to do |format|
      if @download_folder.update_attributes(params[:download_folder])

SELECT * FROM "download_folders" WHERE ("download_folders"."id" = 7)
DELETE FROM "download_folders" WHERE "id" = 7
---
  def destroy
    @download_folder = @club.download_folders.find(params[:id])
    @download_folder.destroy