app/controllers/images_controller.rb

  def index
    @tags = Tag.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
    #Category.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
    @images = Image.all
---
SELECT * FROM "images"

  def show
    @image = Image.find(params[:id], :include => :tags)
---
SELECT * FROM "images" WHERE ("images"."id" = 1)

  def create
    @image = @album.images.new(params[:image])
    @image.url = Image.save(params[:image][:url], @album)
---
INSERT INTO "images" ("name", "updated_at", "tags", "url", "album_id", "desc", "user_id", "created_at") VALUES(NULL, '2009-07-04 02:10:03', 'asrock, netbook', 'asrock_netbook.jpg', 1, 'An AsRock Netbook', 1, '2009-07-04 02:10:03')