app/controllers/users_controller.rb

INSERT INTO "users" ("name", "updated_at", "created_at") VALUES('Guru M', '2009-07-04 00:55:13', '2009-07-04 00:55:13')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save